app/domain/events/vote_command.rb

    def call
      return false unless valid?

      event = Event.find_by(external_id: event_id)
      return false unless event

      event_store = RailsEventStore::Client.new   # ✅ use this only

      case vote_type
      when 'upvote'
        event_store.publish(
          Events::EventUpvoted.new(
            data: {
              event_id: event_id,
              user_id: user_id
            }
          )
        )
        event.increment!(:upvotes_count)

      when 'downvote'
        event_store.publish(
          Events::EventDownvoted.new(
            data: {
              event_id: event_id,
              user_id: user_id
            }
          )
        )
        event.increment!(:downvotes_count)
---
SELECT "events".* FROM "events" WHERE "events"."external_id" = 'sample-event-1' LIMIT 1
UPDATE "events" SET "upvotes_count" = COALESCE("events"."upvotes_count", 0) + 1 WHERE "events"."id" = 1
UPDATE "events" SET "downvotes_count" = COALESCE("events"."downvotes_count", 0) + 1 WHERE "events"."id" = 36