app/controllers/events_controller.rb

  def index
    @events = Event.order(start_date: :asc).page(params[:page]).per(12)
---
SELECT "events".* FROM "events" WHERE (start_date > '2026-05-06 05:19:07.809074') ORDER BY "events"."start_date" ASC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE (start_date > '2026-05-06 05:19:07.809074')